{
  "about": [],
  "services": [
    {
      "url": "https://www.prdentalstudio.com/dental-services",
      "title": "Cosmetic Family Dentist Chicago, IL | Printers Row Dental",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nschedule appointment\nGeneral Dentistry\nKeep your smile for life with preventative and comprehensive treatments.\nProphylaxis (Teeth Cleaning)\nFluoride Treatments\ndigital X-Rays\nOral Cancer Screening\nOcclusal Exam\nDental Emergencies\nTooth Colored Fillings\nDental Sealants\nRoot Canal Therapy\nPeriodontal Care\nSedation Dentistry\nTooth Extractions\nWisdom Tooth Removal\nNightguards for Grinding\nMouthguards\nTMJ Treatment\nSleep Apnea Solutions\nLaser Dentistry\nIn-office 3D Printing\nCosmetic & Restorative Solutions\nSave and transform your smile with handcrafted treatment options.\nInvisalignÂ® Orthodontic Solutions\nDental Implants\nImplant-supported Dentures\nSnap-On Smiles\nVITA EasyshadeÂ® for Tooth Color Matching\nPorcelain Veneers\nKOR in-office Whitening\nSpecialty technology\nTake-home Teeth Whitening\nComposite Bonding\nGum Contouring\nBone & Sinus Grafting\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896106",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/dental-implants",
      "title": "Dental Implants | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nDental Implants\nschedule appointment\nWhen it comes to replacing missing teeth, you have many replacement options. Dental implants are a long-term solution to replacing missing teeth, supporting your existing oral structures, and giving you back your freedom to live your life on your terms. When choosing an oral surgeon, it is imperative that you choose someone you trust. At Printers Row Dental Studio, Dr. Ema is highly-trained and experienced and is committed to providing unparalleled patient care, placing the best dental implants Chicago has to offer.\nThere are a number of reasons why you may need implants. If youâre looking for a trusted Chicago dentist, youâve come to the right place. Dr. Ema understands that dental implant surgery can be a great source of anxiety for many people, and she is proud to offer in-office amenities and sedation to make your experience as comfortable and painless as possible.\nWhy Replacing Teeth is Important\nReplacing missing teeth is not a solely cosmetic concern. There are a number of side effects that you can experience if you donât close the gap left by missing teeth, including:\nChanges to the shape of your face\nMore susceptible to tooth decay and gum disease\nChanges to your bite because the surrounding teeth may start to shift\nIf youâre missing even one tooth, it is very important to explore your replacement option in order to preserve your long-term oral health.\nWhat are Dental Implants\nAll on 4 Before\nAll on 4 After\nImplants are posts that Dr. Ema surgically implants into your jawbone to act as a replacement for the root of your tooth. After the dental implant fuses to your jawbone, Dr. Ema will place a crown on top of the implant that will look and feel like a natural tooth.\nBy replacing a missing tooth with aÂ\ndental implant\n, Dr. Ema helps preserve your jawbone and, in turn, the overall structure of your face.Â One of the most effective and least invasive implants we offer at Printers Row Dental Studio is theÂ\nAll-On 4 treatment\nBenefits of Implants\nDental implants are designed to look, feel, and function like natural teeth\nSince the dental implant fuses with your bone, the discomfort of dentures is not a problem\nWith proper care, dental implants will last many years, and, in some cases, they can last the rest of your life\nDental Implants prevent further bone loss and help retain the shape and appearance of your face\nThey are permanent and stable\nNumber of Sessions\nDental implants are applied in three sessions on average. In the first session, a patientâs measurements are taken to create an implant that is perfectly matched to the patientâs jaw so that it fits well and will stay securely in place.\nDuring the next two appointments, multiple sections of the implant are installed. This process happens in separate sessions to make sure each piece of the implant is securely in place before the next piece is added on.\nWithout a session dedicated to measurement, any implant inserted into the jaw will not fit correctly, coming loose or feeling very painful when being used to bite or chew food.\nÂ Pausing in between treatments also allows the patients to heal before the next procedure so that there is no unnecessary damage done or pain caused.\nWhat Should I Expect?\nDental implant surgery includes the placement of the implants and the placement of the crowns over the implants. Dr. Ema will surgically place the posts into your jawbone, where it will fuse with the bone itself, supporting the surrounding bone structure. Once this process is complete, Dr. Ema will attach abutments to the posts. These abutments will hold your permanent crowns.\nTo learn more about the dental implants we offer, visit our\nÂ implants page on our Chicago Veneers site\nWe understand that surgery can be a frightening prospect for some, and at Printers Row Dental Studio, it is our goal to make your experience as stress-free as possible by providing you with our best care. We are here for anything you may need before, during, and after your surgery. Dr. Ema is specially trained to give you the highest quality of care and comfort.\nIf you need to replace missing teeth, donât wait any longerâimplants may be right for you!\nFor dental implants Chicago can trust, call our office today atÂ\n(312) 435-0411\nÂ to schedule your appointment or\nÂ request one online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896112",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/dentures",
      "title": "",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nschedule appointment\nDentures are a great option for replacing missing teeth. They can replace anywhere from few to all of your teeth, and can be supported by no teeth, limited teeth, or implants. With our digital denture process and fully supported prostheses, Printers Row Dental Studio offers the latest techniques in denture services. Weâll give you dentures you can wear with confidence!\nAt Printers Row Dental Studio, we are dedicated to transforming your smile into something youâre proud to show off!\nWe offer many cosmetic treatments! Printers Row Dental Studio and Chicago Veneers will give you a smile youâll be proud of! Visit our\nChicago Veneers website\nto learn more about our cosmetic dentistry practice.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896113",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/emergency-dental-care",
      "title": "Emergency Dental Care | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nEmergency Dental Care\nschedule appointment\nAre you experiencing a dental emergency? For the best emergency dental care in Chicago, call Dr. Ema at Printerâs Row Dental Studio atÂ\n(312) 435-0411\nIf your dental emergency is life threatening, please call 911 immediately.Â\nWe offer after hours and weekend care for existing patients.\nAt Printers Row Dental Studio, we are devoted to providing you with high-quality personalized dental care. We always do our best to see you on the same day that you call for an emergency dental treatment to ensure that you get the relief that you deserve.\nCommon Emergency Dental Services:\nSevere Toothache or Pain:\nIf you are experiencing a toothache or any severe pain in your mouth, visit us as soon as possible. The only way to cure a toothache is to treat its cause. Dr. Ema will quickly and effectively examine you to ensure that the cause of your severe pain is treated.\nUse ice and an over-the-counter pain medicine like acetaminophen to ease the pain until you can see Dr. Ema.\nChipped or Broken Tooth:\nIf you have a chipped or broken tooth, see Dr. Ema at Printers Row Dental Studio immediatelyâit may be possible to reattach the chipped portion of your tooth. Rinse your mouth with salt water to clean the area and try to stop the bleeding by applying pressure.\nIf you can find the part of your tooth that has chipped, be sure to bring it with you.\nRemember: If the bleeding does not stop, go to the emergency room.\nLost Tooth:\nIf you have lost a tooth or if it has been knocked out, see your dentist as soon as possible. It may be possible to replant the tooth into your jaw if you are able to see your dentist within 1-2 hours. If you still have the tooth, handle it gently. Put the tooth in a glass of milk or in your own saliva and bring it with you.\nRinse your mouth with salt water to clean it and try to stop the bleeding. You can learn more aboutÂ\ncaring for a lost tooth on Colgateâs website\nPain or Abscess:\nIf you have an abscessed tooth, see your dentist at Printers Row Dental Studio as soon as possible. If you are experiencing painful or swollen gums, your dentist will need to determine the underlying cause in order treat you effectively. An abscess is an infection of the gums or tooth root.\nIf the abscess ruptures, you will experience a foul-smelling and foul-tasting pus from the area. Rinse your mouth with salt water if this happens.\nIf you are in need of emergency dental care in Chicago, donât hesitate to call us atÂ\n(312) 435-0411\n! Weâre here for you.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896115",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/invisalign-r",
      "title": "",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nInvisalignÂ®\nschedule appointment\nis a clear, non-metal alternative to traditional braces for transforming your crooked smile. Typically, your aligners are changed weekly, with regular check-up appointments every 6 weeks. With this innovative new treatment, no one will even know youâre wearing your aligners!\nStop letting crooked teeth force you to hide your smile! Visit Printers Row Dental Studio to determine whether or not this innovative treatment is right for you!\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896116",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/periodontal-treatment-in-chicago",
      "title": "Periodontal Treatment In Chicago | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nPeriodontal Treatment In Chicago\nschedule appointment\nPeriodontitis, or gum disease, is caused by the bacteria found in dental plaque. Gingivitis is the least severe form of gum disease, followed by periodontitis and advanced periodontitis. If dental plaque is left on the teeth, it becomes tartar, which can only be removed by a dental professional. The build-up of tartar causes inflamed gums, leading to an infection that can damage the tissue and bone structures in your mouth: periodontal disease. If youâre looking for periodontal treatment in Chicago, youâve come to the right place.\nAt Printers Row Dental Studio, we are devoted to diagnosing and treating your periodontal disease. It is our priority to ensure that you receive the kind and personalized care you deserve.\nSymptoms of Periodontal Disease\nSince periodontal disease is often painless, it is important to watch for other symptoms. Some common symptoms of periodontal disease are:\nBleeding gums\nSwollen or red gums\nTender or painful gums\nReceding gums\nHalitosis (bad breath) or bad taste in your mouth\nPus surrounding your gums or teeth\nLoose teeth\nShifting teeth\nSpace between teeth\nCauses of Periodontal Disease\nPeriodontitis is caused by the remaining plaque and tartar on your gums, which irritates and inflames your gums. Persistent inflammation of the gums causes pockets between your teeth and gums. The pockets that are created by the inflammation can fill with bacteria, plaque, and tartar. Consequently, this may lead to infection. The infection can eventually cause degradation of soft tissue and bone. However, while the accumulation of plaque and tartar deep in the gums is often the cause of periodontitis, other factors include, but are not limited to the following:\n: Some people are predisposed to periodontal disease.\n: Sometimes hormonal changes and pregnancy can make you more susceptible to periodontitis.\nMedications\n: Certain medications can cause a decrease in the production of saliva and can, therefore, contribute to periodontitis. Additionally, some medications can cause an overgrowth of gingiva, or gums, making your gums more susceptible to the deep build-up of plaque and tartar.\nTobacco use\n: Tobacco causes periodontal disease and promotes the growth of harmful bacteria.\n: Diabetes can make you more susceptible to infections, including gum disease. If you have periodontal disease, it will be worse if you have diabetes. Furthermore, it is even harder to control your blood sugar if you have periodontitis.\n: A balanced diet that is sufficient in vitamin C and calcium is vital to your oral health. Calcium supports healthy bones, and vitamin C promotes healthy connective tissue. If your diet is lacking these key components, you may be more susceptible to periodontitis.\nWhat to Expect at Your Appointment\nAt Printers Row Dental Studio, we are committed to putting your oral health first. During your initial visit, Dr. Ema will review your medical history and the medications you are taking to ensure that the underlying cause of your periodontitis is considered during the development of your personalized treatment plan.\nWe will examine your gums to determine whether the removal of plaque and tartar will be sufficient to treat your periodontitis. If scaling, the removal of the plaque and tartar, is not sufficient, your dentist may perform a root planing treatment, during which the infected root surface is cleaned. Another possible treatment is a root surface debridement treatment, during which time your dentist will remove the damaged tissue.\nIf you are experiencing any of these symptoms, donât wait to save your teeth. Call our office today atÂ\n(312) 435-0411\nÂ for the best periodontal treatment in Chicago, orÂ\nrequest one online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896117",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/root-canal",
      "title": "Root Canal | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nschedule appointment\nAlmost everyone can speak to the popularity of root canalsâno one wants one. However, needing a root canal is really not such a horrible thing. In fact, if your dentist tells you that you need a root canal, it means that saving your natural tooth is possible! At Printers Row Dental Studio, weâre devoted to giving you a healthy, beautiful smile, especially when that means you can keep your natural teeth.\nWhy Would I Need a Root Canal?\nWhen the inside of your tooth, or the pulp, is badly and/or deeply decayed such that it causes inflammation and infection, Dr. Ema may suggest a root canal. This procedure allows Dr. Ema to clean out the decayed tissue and stop your tooth from experiencing further damage and decay. If the infection is left, it can lead to an abscess, which can cause severe periodontal disease and abscessed gums.\nSigns you may have an Infection:\nSevere tooth pain\nVery sensitive teeth\nTooth discoloration\nSwollen gums surrounding an infected tooth\nWhat Happens During the Procedure?\nDuring your procedure, Dr. Ema will remove the pulp of your tooth and carefully clean and disinfect the root canal. After your tooth has been disinfected, Dr. Ema will seal it up with a rubber-like material. This may take one or two visits to complete. Once this is done, Dr. Ema will use a crown or filling to restore your tooth.\nAlthough some people believe the procedure to be unsafe, having a root canal is not only safe but allows you to keep your natural teeth. Nothing looks quite as good or functions quite as well as your natural teeth. Dr. Ema at Printers Row Dental Studio is highly-trained and experienced in performing root canals. Saving your natural teeth should always be your first choice.\nWe understand that needing root canals can be stressful. At Printers Row Dental Studio, we do everything we can to make your visit as pleasant as possible.\nAre Root Canal Procedures Safe?\nÂ Despite recent media attention claiming that root canal treatments are unsafe and the cause of disease or cancers, the treatment itself is safe and will not inherentlyÂ\nany disease or cancer. Recent media sources are citing hundred year old science that has since been disproven. During treatment, the infection is removed from the tooth, thereby removing infectious tissue and allowing the surrounding tissue to heal.\nTo learn more about the safety of root canals, please see theÂ\nAmerican Association of Endodontistsâ article and video about the safety of root canal treatment\nIf you have any questions about the safety or efficacy of root canal treatment, please donât hesitate to ask us at Printers Row Dental Studio.\nDonât put off saving your natural smile. Call Printers Row Dental Studio today atÂ\n(312) 435-0411\nrequest an appointment online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896118",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/sedation-dentistry",
      "title": "Sedation Dentistry | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nSedation Dentistry\nschedule appointment\nAt Printers Row Dental Studio, we understand that vising the dentist can be a fearful event. In an effort to provide the best care possible, we offer sedation dentistry for our patients who request it. We understand that dental procedures can generate a great deal of anxiety, and so we are dedicated to ensuring that you are able to receive proper dental care despite your fears. Many oral health procedures are essential to good oral and overall health, and we strive to make sure that as many people as possible get the care they need to live their best lives!\nAnxiety over trips to the dentist doesnât have to get in the way of your oral health when you visit Printers Row Dental Studio!Â Sedation dentistry uses different levels of sedation, chosen on a patient-by-patient or procedure-by-procedure basis.\nAt Printers Row Dental Studio, we offer minimal sedation by way of nitrous and valium. This type of sedation leaves youÂ awake, but relaxed enough that you will not cause fear or anxiety. We try to manage fear and anxiety with medication and other relaxing amenities like blankets, music, and even Netflix.\nAll dental procedures completed using sedation dentistry will require that you have a ride home because you will not be fit to drive following your procedure. It is important to note that every individual reacts to sedation differently, so you and Dr. Ema must determine the best type of sedation for you based on your health history, any prior reactions to sedation, and your specific procedure.\nIf you want to know more about sedation dentistry, talk with Dr. Ema or any of the friendly staff at Printers Row Dental Studio!\nAt Printers Row Dental Studio, your oral health is our top priority. To learn more about how sedation dentistry can make your dental care experience more comfortable, call our office today atÂ\n(312) 432-0411\nÂ to schedule your appointment, orÂ\nrequest one online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896119",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/sleep-apnea-dental-devices",
      "title": "Sleep Apnea Dental Devices | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nSleep Apnea Dental Devices\nschedule appointment\nSleep apnea is a sleep disorder that causes you to repeatedly stop breathing during the night. It is a serious sleeping disorder because you will often not know that breathing has stopped, and the body and brain can be deprived of oxygen for lengthy periods of time. However, a dental device for sleep apnea can help you get a good nightâs sleep and take back your life.\nObstructive sleep apnea (OSA) is the most common type of sleep apnea, and it occurs when the muscles and soft tissue in the back of the throat relax so much that they collapse. Oral appliance therapy is an effective treatment for mild to moderate sleep apnea. If youâre ready to start living your best life again, call Dr. Ema.\nWhy Treating Sleep Apnea is Important\nTreating sleep apnea will not only help you stop snoring. and get a good nightâs rest, but it will also help prevent serious side effects of sleep apnea. People with sleep apnea are more likely to develop high blood pressure and diabetes and are also at an increased risk for heart attacks and strokes. Because your brain doesnât get the oxygen it needs while youâre sleeping, sleep apnea is a serious condition that should be treated.\nStart living your best life and take back your sleep!\nSymptoms of sleep apnea\nSleepiness throughout the day\nExcessive and extremely loud snoring\nMorning headaches\nMemory loss\nYour sleep physician will diagnose your sleep apnea and will often perform a sleep study to determine whether you are a candidate for an oral appliance.\nTreating Sleep Apnea\nOral appliance therapy is an effective treatment for mild to moderate OSA. By supporting the jaw in a forward position, oral appliance therapy helps keep the airway open.Â At Printers Row Dental Studio, we treat sleep apnea by creating a customized dental device that is designed to push your jaw forward such that it supports the soft tissue and prevents your airways from becoming blocked while you sleep.\nAt Printers Row Dental Studio, we will work closely with you during your initial evaluation, where we will discuss the benefits, side effects, and cost of oral appliance therapy to help you make the most informed decision about how you want to treat your sleep apnea.\nDuring your appointment with Dr. Ema, she will complete an examination of your teeth, jaw, tongue, and airway. If need be, we will take new X-rays of your mouth. Your oral appliance will then be custom made in a lab. Once it is complete, you will have a fitting in our office. During this time, your dentist will ensure that the appliance fits properly and will work effectively. You will also learn how to care for and clean your appliance.\nYour sleep physician will likely want you to do another sleep study to ensure that the oral appliance is working the way that it should. Dr. Ema will likely also want to see you for a follow up appointment to ensure that the appliance still fits appropriately and is working effectively.\nIf you are suffering from sleep apnea, a good nightâs sleep may only be one oral appliance away. Call our office today atÂ\n(312) 435-0411\nrequest an appointment online\nÂ to schedule your appointment!Â\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896121",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/snap-on-smiles",
      "title": "",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nSnap-On Smiles\nschedule appointment\nSnap-On Smiles\nare an alternative to traditional veneers that simply clip on over your teeth, instantly giving you a beautiful, radiant smile. Since they are not typically intended to be worn all day, people generally wear them for work, events, or photos. Sometimes called press-on veneers, Snap-On Smiles gives you the beautiful smile that youâve always wanted quickly and easily.\nCall us at Printers Row Dental Studio to learn more about how Snap-On Smiles can give you your best smile.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896122",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/specialty-technology",
      "title": "Specialty Technology | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nSpecialty Technology\nschedule appointment\nEverywhere you look, technological improvements are making life easier. At Printers Row Dental Studio, we use cutting edge specialty technology to ensure you receive the highest-quality, comprehensive dental care.\nWeâre committed to offering our patients the latest high-quality technology to provide unparalleled care.\nDigital X-rays\nDental X-rays are an important part of oral preventative maintenance. Digital X-rays are one of the ways your dentist at Printers Row Dental Studio can get an accurate picture of your oral health. Today, digital X-rays are rapidly replacing traditional X-ray film methods, and they produce computer images of teeth, gum, and other oral structures. These images allow your dentist to spot the earliest signs of dental issues, which is essential in treating them effectively and preventing potential discomfort and costly procedures.\nDigital X-rays require less radiation than traditional film X-rays. They also eliminate chemical processing and disposal of hazardous waste, making them a superior, âgreenerâ alternative.\nVITA EasyshadeÂ®\nTooth color can vary from tooth to tooth. The VITA EasyshadeÂ® is a digital spectrophotometer that passes light through a tooth to assess its color. This tool allows your dentist at Printers Row Dental Studio to determine the correct shading of your natural teeth and ceramic restorations to ensure an accurate color match.\nThe VITA EasyshadeÂ® accurately identifies the color of your teeth so that Dr. Ema can ensure that your dental appliances correctly match your surrounding teeth:\nceramic fillings\nprosthetic teeth\nceramic restorations\nYour dentist may even use this tool to determine tooth whitening\nDigital Photography\nA picture is worth a thousand words, and thatâs true at Printers Row Dental Studio. Since digital photography is common and easy to use, we use this technology to document the condition of your teeth to send to the lab and to track your progress. Digital photography is a valuable tool for record-keeping and lab communication.\nBest of all, with digital photography, the images we capture can showcase the changes we make to improve your smile and oral health!\n3Mâ¢ True Definition Intraoral Scanner\nThe 3Mâ¢ True Definition Intraoral Scanner allows your dentist at Printers Row Dental Studio to create a fast and accurate digital dental impression. The scanner uses a hand-held wand to create an accurate 3D replica of your oral anatomy, giving your dentist a true picture of your mouth. The 3Mâ¢ True Definition Scanner is a great solution for patients who have had previous problems with conventional dental impressions, due to strong gag-reflex.\nDiode Laser\nAt Printers Row Dental Studio, we use a diode laser for soft tissue so that we canÂ perform fernectomies & gingivectomies. This laser is painless and causes very little bleeding. Additionally, it requires a very short recovery time. For general restorative procedures and fernectomies & gingivectomies, the diode laser is an excellent and painless option.\nYour dental exam is just as important as your other healthcare checkups. At Printers Row Dental Studio, your oral health is our top priority! We are here to answer any questions that you may have about your overall oral health and ways to ensure that you maintain a strong, healthy smile. Our dentists and dental hygienists are highly trained and experienced dental professionals who are devoted to keeping your mouth healthy, so that you can live your best life.\nTo learn about how our cutting edge specialty technology can improve your smile, call us today atÂ\n(312) 435-0411\nÂ to schedule your appointment!\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896123",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/tmj-treatment",
      "title": "TMJ Treatment | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nTMJ Treatment\nschedule appointment\nYour temporomandibular joints (TMJ) are the joints responsible for allowing you to chew, swallow, and speak, and they connect your lower jaw, or mandible, to your skull. When the joints or muscles become sore or painful, they can cause debilitating headaches, difficulties with speech, and problems chewing. If the system of muscles, ligaments, and joints becomes disrupted or painful, you may have temporomandibular joint disorder (TMD). For expert TMJ treatment, visit Chicagoâs leading dentist, Dr. Ema.Â\nSymptoms of TMJ disorders:\nJaw stiffness\nLocking jaw\nPopping or clicking jaw\nPain when opening or closing mouth\nPainful chewing\nInability to line up jaw properly\nTired facial muscles\nCauses of TMJ disorders:\nJaw alignment\nDislocation\nDr. Ema at Printers Row Dental Studio will perform a thorough examination of your joints and muscles to determine whether you have any popping, difficulties with mobility, or tenderness. If you are diagnosed with TMJ disorder, Dr. Ema will work closely with you to develop a comprehensive, personalized treatment plan centered around treating your pain and treating the root cause of your TMD.Â\nTMD & TMJ treatments:\nReliving your pain from TMD is our primary focus in the course of your treatment.\nNight guards: Night guards can help you avoid clenching or grinding your teeth while you sleep, so your muscles can experience relief from the extra tension of clenching.\nOcclusal splint: An occlusal splint is worn over your teeth like a mouthguard, and has the ability to make changes to your bite, so you can experience relief from your TMJ pain. Unlike other types of mouthguards, occlusal splints are made of acrylic.\nBotoxÂ®: We can use BotoxÂ® to help treat TMJ pain.\nIf you are suffering from TMJ-related pain, donât wait any longer to get relief. Call Printers Row Dental Studio today atÂ\n(312) 435-0411\nÂ to schedule your appointment orÂ\nrequest one online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896124",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/tooth-extractions",
      "title": "Tooth Extractions | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nTooth Extractions\nschedule appointment\nIf your tooth is badly damaged from injury or decay and cannot be saved, your dentist will likely recommend tooth extraction. A tooth extraction is the procedure whereby your dentist removes the damaged tooth from your jaw.\nAfter Dr. Ema recommends a tooth extraction, she will take an X-ray to develop the best personalized plan to remove the tooth. If you are having your wisdom teeth removed, we will take X-rays of your entire jaw to gauge the best removal plan, ensuring proper removal and care for the rest of your oral, sinus, and jawbone health.\nPossible reasons for a tooth extraction\nBaby teeth donât fall out in time to allow permanent teeth to come in\nWisdom teeth need to be extracted\nOrthodontic treatment requiring room to be made in your mouth\nSome teeth block others from coming in properly\nTooth decay and periodontitis\nSevere injury has damaged a tooth beyond repair\nWisdom Tooth Extraction\nWhy do I need my wisdom teeth removed?\nFor most people, there isnât enough room in their mouths to accommodate their wisdom teeth. Therefore, wisdom teeth can cause major problems for the rest of your teeth after they erupt. There are three main reasons that you may need your wisdom teeth extracted:\nYour jaw isnât large enough to accommodate more teeth.\nYour wisdom teeth grow in at an angle, pressing on the neighboring teeth.\nOr, your wisdom teeth are impacted, meaning that your wisdom teeth get trapped in your jawbone or gums.\nHow do I know if I need my wisdom teeth removed?\nUsually Dr. Ema will look at your x-rays and determine whether your wisdom teeth will be problematic. If Dr. Ema believes that your wisdom teeth will be problematic, she will suggest extraction during yourÂ\nregular exam\nIf you are experiencing any pain, swelling, or stiffness in your mouth around where your wisdom teeth are erupting, they will need to be removed. While they are erupting, they can leave openings in your gums that leave you susceptible to infection.\nIf the pressure from your erupting wisdom teeth is painful, it may be putting harmful stress on the surrounding teeth, causing your other teeth to move or even crack.\nIf you have an impacted wisdom tooth, a cyst can form around the impacted tooth, which can harm the jawbone and the rest of your teeth.\nWhat Should I Expect?\nWith all tooth extractions, you will receiveÂ\n. Dr. Ema will discuss your options with you and guide you in choosing the best anesthetic option for you. With simple extractions, local anesthesia is common. At Printers Row Dental Studio, we will ensure that you do not you feel any pain during your procedure, and we always strive to make you as comfortable as possible. As with any anesthesia, you will require a ride home, as you will not be fit to drive following your procedure.\nThough it is common to experience pressure during the procedure, you should not feel any pain. You will experience some discomfort after the extraction, especially with surgical extractions, but NSAID (Nonsteroidal anti-inflammatory drug) pain-relievers will help to manage any discomfort.\nAt Printers Row Dental Studio, your oral health is our top priority. We understand how overwhelming oral surgery and tooth extractions can be, and we are here to answer all your questions about the procedure, recovery, and what to do once your tooth has been removed. At Printers Row Dental Studio, youâll receive the high-quality and personalized dental care you deserve.\nDonât let damaged teeth cause you pain and ruin your smile. If you need a tooth extraction, donât wait any longer. Call our office today atÂ\n(312) 435-0411\nÂ to schedule your appointment, orÂ\nrequest one online\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896125",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/veneers",
      "title": "",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nschedule appointment\nPorcelain dental veneers are a thin layer of material that Dr. Ema places on top of your tooth to change the appearance of your teeth and transform your smile. Veneers are as easy to care for as your natural teeth and can be installed in just two visits. Veneers help conceal a wide variety of dental issues, such as misaligned teeth, discolored teeth, or worn-down, chipped, or gapped teeth.\nAt Printers Row Dental Studio, we have several veneer options to suit your needs.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896126",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/dental-services/whitening",
      "title": "",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nschedule appointment\nDonât let stained or discolored teeth ruin your smile. There are many common factors associated with tooth discoloration. Some common causes are food or drug relatedâespecially coffee and red wine, tobacco and medications. Â It can even be the result of normal aging. Although some of these factors are avoidable, some simply are not.\nAt Printers Row Dental Studio, we offer KÃ¶r Whitening, the latest advancement in teeth whitening technology. If you wish you had whiter teeth, donât wait any longer to visit Printers Row Dental Studio and get the radiant smile youâve always wanted!\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896128",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/dental-services",
      "title": "Cosmetic Family Dentist Chicago, IL | Printers Row Dental",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nschedule appointment\nGeneral Dentistry\nKeep your smile for life with preventative and comprehensive treatments.\nProphylaxis (Teeth Cleaning)\nFluoride Treatments\ndigital X-Rays\nOral Cancer Screening\nOcclusal Exam\nDental Emergencies\nTooth Colored Fillings\nDental Sealants\nRoot Canal Therapy\nPeriodontal Care\nSedation Dentistry\nTooth Extractions\nWisdom Tooth Removal\nNightguards for Grinding\nMouthguards\nTMJ Treatment\nSleep Apnea Solutions\nLaser Dentistry\nIn-office 3D Printing\nCosmetic & Restorative Solutions\nSave and transform your smile with handcrafted treatment options.\nInvisalignÂ® Orthodontic Solutions\nDental Implants\nImplant-supported Dentures\nSnap-On Smiles\nVITA EasyshadeÂ® for Tooth Color Matching\nPorcelain Veneers\nKOR in-office Whitening\nSpecialty technology\nTake-home Teeth Whitening\nComposite Bonding\nGum Contouring\nBone & Sinus Grafting\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896134",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/dental-services/emergency-dental-care",
      "title": "Emergency Dental Care | PR Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nEmergency Dental Care\nschedule appointment\nAre you experiencing a dental emergency? For the best emergency dental care in Chicago, call Dr. Ema at Printerâs Row Dental Studio atÂ\n(312) 435-0411\nIf your dental emergency is life threatening, please call 911 immediately.Â\nWe offer after hours and weekend care for existing patients.\nAt Printers Row Dental Studio, we are devoted to providing you with high-quality personalized dental care. We always do our best to see you on the same day that you call for an emergency dental treatment to ensure that you get the relief that you deserve.\nCommon Emergency Dental Services:\nSevere Toothache or Pain:\nIf you are experiencing a toothache or any severe pain in your mouth, visit us as soon as possible. The only way to cure a toothache is to treat its cause. Dr. Ema will quickly and effectively examine you to ensure that the cause of your severe pain is treated.\nUse ice and an over-the-counter pain medicine like acetaminophen to ease the pain until you can see Dr. Ema.\nChipped or Broken Tooth:\nIf you have a chipped or broken tooth, see Dr. Ema at Printers Row Dental Studio immediatelyâit may be possible to reattach the chipped portion of your tooth. Rinse your mouth with salt water to clean the area and try to stop the bleeding by applying pressure.\nIf you can find the part of your tooth that has chipped, be sure to bring it with you.\nRemember: If the bleeding does not stop, go to the emergency room.\nLost Tooth:\nIf you have lost a tooth or if it has been knocked out, see your dentist as soon as possible. It may be possible to replant the tooth into your jaw if you are able to see your dentist within 1-2 hours. If you still have the tooth, handle it gently. Put the tooth in a glass of milk or in your own saliva and bring it with you.\nRinse your mouth with salt water to clean it and try to stop the bleeding. You can learn more aboutÂ\ncaring for a lost tooth on Colgateâs website\nPain or Abscess:\nIf you have an abscessed tooth, see your dentist at Printers Row Dental Studio as soon as possible. If you are experiencing painful or swollen gums, your dentist will need to determine the underlying cause in order treat you effectively. An abscess is an infection of the gums or tooth root.\nIf the abscess ruptures, you will experience a foul-smelling and foul-tasting pus from the area. Rinse your mouth with salt water if this happens.\nIf you are in need of emergency dental care in Chicago, donât hesitate to call us atÂ\n(312) 435-0411\n! Weâre here for you.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "services",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896139",
        "status_code": "200"
      }
    }
  ],
  "team": [],
  "blog": [],
  "general": [
    {
      "url": "https://prdentalstudio.com",
      "title": "Dentist in Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nwith your Chicago Dentist\nschedule appointment\nRelax as we help you look, feel, and be your best.\nthe printers row difference\nthe guest experience\npatient experience\nAs a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists.\nMeet Your Smile Artist\nComprehensive. Cosmetic. Restorative.\nUnmatched smile solutions for the windy city.\nSMILE SERVICES\nsmile gallery\nWant a new smile?\nAfter a few short visits with Dr. Ema, youâll experience a perfectly aligned, stunningly beautiful smile with the magic of veneers.\nchicago veneers\nâA wonderful experienceâ\nA wonderful experience from start to finish! I went to see Dr Kaori Ema for a teeth whitening session before my sister's wedding so I could look wedding day photo ready! I was there for about an hour or so and was super happy with the results. The before and after photos were so easy to see the change in my teeth. Thank you for making me feel my best!\npatient reviews\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896102",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com",
      "title": "Dentist in Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nwith your Chicago Dentist\nschedule appointment\nRelax as we help you look, feel, and be your best.\nthe printers row difference\nthe guest experience\npatient experience\nAs a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists.\nMeet Your Smile Artist\nComprehensive. Cosmetic. Restorative.\nUnmatched smile solutions for the windy city.\nSMILE SERVICES\nsmile gallery\nWant a new smile?\nAfter a few short visits with Dr. Ema, youâll experience a perfectly aligned, stunningly beautiful smile with the magic of veneers.\nchicago veneers\nâA wonderful experienceâ\nA wonderful experience from start to finish! I went to see Dr Kaori Ema for a teeth whitening session before my sister's wedding so I could look wedding day photo ready! I was there for about an hour or so and was super happy with the results. The before and after photos were so easy to see the change in my teeth. Thank you for making me feel my best!\npatient reviews\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896103",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/difference",
      "title": "Best patient experience in Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nThe Printers Row Difference\nschedule appointment\nThe Difference\nA bit of luxury\nLike a five-star hotel, you can expect the unexpected with luxurious amenities including Netflix, warm blankets, eye mask, neck pillow, headphones, lavender aromatherapy and sedation options to keep you comfortable.\nA heart for relationships\nDriven by a desire to build lifelong friendships with our patients, we always take our time to listen closely to you and your story.\nA smile artist with world class skill\nAs a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists. Add to that, her teaching experience, AEGD residency, and over 2000 hours of continuing education, and you get stunning smile transformations and unrivaled dental expertise.\nkeep you in charge\nWeâll diagnose, offer a full menu of solutions, and answer all your questions â but you always get to choose the care you want without any pressure from us.\nmodern technology\nTo make your care easier, faster, and more effective, we use leading-edge technology like digital x-rays, 2D and 3D radiography, high-definition photography, gunk-free digital impressions, diode lasers, a digital spectrophotometer for color matching, and more.\nâOVERWHELMED with love, charm, & joy!â\nAnytime you have to visit the dentist, there can be some anxiety. However, anytime I enter Printer's Row Dentall Studio, I am OVERWHELMED with love, charm, and joy! The team is exceptionally hospitable and Dr. Ema is not only one of the most high quality profressionals I've ever had the pleasure to meet, she makes me feel comfortable and safe in her care!\npatient reviews\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896104",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/meet",
      "title": "Dr. Kaori Ema Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nMeet your smile artist\nschedule appointment\nDr. Emaâs Story\nKaori Ema, DDS, MAGd\nRecognized as a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists. She has completed over 2000 hours of continuing education and has advanced training in at least 16 disciplines in dentistry.\nJourney to Dentistry\nWhile attending a math and science high school in the Chicago area, Dr. Ema completed a research project on dental implants. That little project set her on the path to becoming a dentist.\nDental Education\nDr. Ema earned her Doctor of Dental Surgery degree at the University of Illinois at Chicago College of Dentistry where she received multiple awards for leadership and clinical excellence.\nAir Force Dentist\nFollowing in her grandfatherâs footsteps, Dr. Ema went on to serve as a dentist in the United States Air Force. She completed her Advanced Education in General Dentistry residency program at Scott Air Force Base and went on to provide dental care for service members and their families at Hanscom Air Force Base near Boston.\nBack to Chicago\nReturning home after serving her country, she taught dental students at her alma mater before Printers Row Dental Studio was born.\nâI wanted to build something that was focused on creating long-term relationships with patients while representing my priorities of compassion, integrity, and excellence.â\nGiving Back\nPassionate about people, she loves volunteering at home and abroad. Sheâs had the honor of providing dentistry to remote islanders in Fiji and rural Mayan children in Guatemala, as well as serving on a military humanitarian mission to Honduras. To express her gratitude to the men and women who serve this country, she offers free dental care for veterans on Veterans Day.\nPersonal Life\nShe loves spending time with family and friends. She also enjoys trying unique foods and restaurants, pilates, Chicago street festivals, and traveling. a few recent highlights include a trip to Japan, and a Dental mission yoga retreat to the Dominican Republic.\nâMy mission is to help you look, feel, and be your best!â\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896105",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/patient-center",
      "title": "Visit Printers Row Dental Studio in Chicago, IL.",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWelcome to the Patient Center\nschedule appointment\nMake a payment\nPatient Forms\nFirst Visit\nEnjoy a world class dental experience.\nWhat to Expect\nYouâll receive a comprehensive exam with digital x-rays, oral cancer screening, occlusal exam, a cleaning, answers to all your questions, and a team focused on providing solutions that fit you.\nWhat to Bring\nPlease bring a few things along for your first visit.\n(such as a valid driverâs license)\nInsurance card\n(for those with dental insurance)\nQuestions, concerns, and hopesâ¨for your smile\nFinancesâ¨& Insurance\nWith a desire to never limit your care, we are not contracted with insurance companies. However, we are insurance friendly and will do all we can to help you maximize your insurance benefits. We also offer a variety of payment options including dental financing with Lending Club, CareCredit, and more.\nMembership Plan\nFor one low fee of $55/year you can access major discounts with no waiting periods and no maximum benefit limits. Only pay for what you use with no co-pays, deductibles, or claim denials. Members also receive $200 toward Invisalign or veneers!\nDental wellness membership\n40% off preventative\n20% off periodontal scalingâ¨& root planing\n10% off General, whitening, retainers\n$200 Veneer or ortho credit\nâwonderfulâ\nThe entire experience was wonderful; yes I said wonderful, referring to a dental appointment!! The entire staff is warm and friendly. They make you feel as though youâve been going there all along. Dr. Ema, hands down is the best dentist Iâve ever been to! I could go on, but Iâm really happy I found Printers Row Dental Studio. Iâll never go anywhere else!\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896107",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/stories",
      "title": "Patient Reviews for Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nPatient Stories\nschedule appointment\nShare Your Story\nPatients love Printers Row Dental Studio and we love sharing their stories. If you enjoyed your experience with us, a note from you would help others looking for a world class dental experience. Please leave us a review on one of the following sites:\nâWell worth the moneyâ\nDr. Ema and her staff are amazing! Incredibly professional, explanatory, and thorough in their work. The pricing and membership plans are well worth the money. I would recommend this place to anyone; they truly take care of you and your dental health!\ncaroline r.\nâamazing dentistâ\nIf you are looking for an amazing dentist in Chicago, look no further! Dr. Ema is professional, caring and detailed-oriented. She took her time to answer all the questions and address any concerns that I had during my visit, and she made sure that I felt comfortable during the procedure. The office staff is great, too! Always very welcoming and helpful. I highly recommend Printers Row Dental Studio!\nâVery friendlyâ\nI had such a great experience at this office! The hygienist and dentist explained things better than any office I have been to before. Not only that, my cleaning was literally painless and was also extremely efficient. I feel that my treatment plan actually makes sense in that I know exactly what I am paying for going forward. Spotlessly clean office with a great atmosphere, very friendly reception.\nâone of the bestâ\nI have been to at least a dozen different dentists in my life and this one is the best. All of the staff is kind, personable and understanding. I've never had such care and explanation during each step of cleaning, getting a filling and after care.\nâwarm, welcoming & helpfulâ\nI always enjoy my experience at Printers Row Dental. The staff is always very warm, welcoming, and helpful. It makes me feel a lot more comfortable and Dr.Ema is great.\nâgreat energyâ\nThis place is beautiful! Dylan the receptionist has a great energy and definitely made me feel welcomed. The hygienists and Dr. Kaori were just as wonderful. They play great music and gave me so much knowledge on my teeth and braces. My previous dentist didn't tell me about any of my cavities but Dr. Kaori found 6 and even showed me the photos and xrays. I felt like I really understood my mouth and like they cared. 10/10 recommend!\nâthe best dental teamâ\nI canât figure out who I love the most; from the two amazing front desk/office managers to the hygienist to Dr Emma herself, they all make coming to the dentist much more pleasurable for me. The office is welcoming, clean, they are always on time, highly amazing at what they do, and they go out of their way to ensure you have the best care. Thank you to the best dental team in Chicago!\nâbest experienceâ\nBest experience you can have at a dentist. Seamless, informative and very well priced. Highly recommend!!\nâincredibly thoroughâ\nI had my first cleaning here yesterday and I have never been more impressed with a dental office. I get anxiety while going to the dentist but everyone here is super educational and helped me understand things that a previous dentist has never done. They were also incredibly thorough while cleaning my teeth. I canât say enough good things about this office!\nâFriendly neighborhood dentist!â\nFriendly neighborhood dentist! Dr. Ema is so easy to talk to, non-judgmental, and incredibly informative. Her office staff is fantastic too - Dillon was great at the front desk. So thankful to have found a wonderful team in my new city!\nCharlotte E.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896109",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/smile-gallery",
      "title": "Smile gallery Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nStunning Smile Transformation\nschedule appointment\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896110",
        "status_code": "200"
      }
    },
    {
      "url": "https://www.prdentalstudio.com/connect",
      "title": "Contact Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nConnect with Us\nVisit Printers Row Dental Studio in Chicago, IL\nschedule appointment\nWe canât wait to meet you\n312-435-0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule an appointment\nget directions\n705 S Clark St\nSuite 1Aâ¨\nChicago, IL 60605\nsend us a message\nThank you for reaching out!\nYour message has been sent. We'll be in touch soon.\nOops! Something went wrong while submitting the form.",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896111",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/",
      "title": "Dentist in Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nwith your Chicago Dentist\nschedule appointment\nRelax as we help you look, feel, and be your best.\nthe printers row difference\nthe guest experience\npatient experience\nAs a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists.\nMeet Your Smile Artist\nComprehensive. Cosmetic. Restorative.\nUnmatched smile solutions for the windy city.\nSMILE SERVICES\nsmile gallery\nWant a new smile?\nAfter a few short visits with Dr. Ema, youâll experience a perfectly aligned, stunningly beautiful smile with the magic of veneers.\nchicago veneers\nâA wonderful experienceâ\nA wonderful experience from start to finish! I went to see Dr Kaori Ema for a teeth whitening session before my sister's wedding so I could look wedding day photo ready! I was there for about an hour or so and was super happy with the results. The before and after photos were so easy to see the change in my teeth. Thank you for making me feel my best!\npatient reviews\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896129",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/difference",
      "title": "Best patient experience in Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nThe Printers Row Difference\nschedule appointment\nThe Difference\nA bit of luxury\nLike a five-star hotel, you can expect the unexpected with luxurious amenities including Netflix, warm blankets, eye mask, neck pillow, headphones, lavender aromatherapy and sedation options to keep you comfortable.\nA heart for relationships\nDriven by a desire to build lifelong friendships with our patients, we always take our time to listen closely to you and your story.\nA smile artist with world class skill\nAs a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists. Add to that, her teaching experience, AEGD residency, and over 2000 hours of continuing education, and you get stunning smile transformations and unrivaled dental expertise.\nkeep you in charge\nWeâll diagnose, offer a full menu of solutions, and answer all your questions â but you always get to choose the care you want without any pressure from us.\nmodern technology\nTo make your care easier, faster, and more effective, we use leading-edge technology like digital x-rays, 2D and 3D radiography, high-definition photography, gunk-free digital impressions, diode lasers, a digital spectrophotometer for color matching, and more.\nâOVERWHELMED with love, charm, & joy!â\nAnytime you have to visit the dentist, there can be some anxiety. However, anytime I enter Printer's Row Dentall Studio, I am OVERWHELMED with love, charm, and joy! The team is exceptionally hospitable and Dr. Ema is not only one of the most high quality profressionals I've ever had the pleasure to meet, she makes me feel comfortable and safe in her care!\npatient reviews\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896130",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/patient-center",
      "title": "Visit Printers Row Dental Studio in Chicago, IL.",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWelcome to the Patient Center\nschedule appointment\nMake a payment\nPatient Forms\nFirst Visit\nEnjoy a world class dental experience.\nWhat to Expect\nYouâll receive a comprehensive exam with digital x-rays, oral cancer screening, occlusal exam, a cleaning, answers to all your questions, and a team focused on providing solutions that fit you.\nWhat to Bring\nPlease bring a few things along for your first visit.\n(such as a valid driverâs license)\nInsurance card\n(for those with dental insurance)\nQuestions, concerns, and hopesâ¨for your smile\nFinancesâ¨& Insurance\nWith a desire to never limit your care, we are not contracted with insurance companies. However, we are insurance friendly and will do all we can to help you maximize your insurance benefits. We also offer a variety of payment options including dental financing with Lending Club, CareCredit, and more.\nMembership Plan\nFor one low fee of $55/year you can access major discounts with no waiting periods and no maximum benefit limits. Only pay for what you use with no co-pays, deductibles, or claim denials. Members also receive $200 toward Invisalign or veneers!\nDental wellness membership\n40% off preventative\n20% off periodontal scalingâ¨& root planing\n10% off General, whitening, retainers\n$200 Veneer or ortho credit\nâwonderfulâ\nThe entire experience was wonderful; yes I said wonderful, referring to a dental appointment!! The entire staff is warm and friendly. They make you feel as though youâve been going there all along. Dr. Ema, hands down is the best dentist Iâve ever been to! I could go on, but Iâm really happy I found Printers Row Dental Studio. Iâll never go anywhere else!\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896131",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/meet",
      "title": "Dr. Kaori Ema Chicago, IL | Printers Row Dental Studio",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nMeet your smile artist\nschedule appointment\nDr. Emaâs Story\nKaori Ema, DDS, MAGd\nRecognized as a Master in the Academy of General Dentistry, Dr. Ema is in the top 2% of dentists. She has completed over 2000 hours of continuing education and has advanced training in at least 16 disciplines in dentistry.\nJourney to Dentistry\nWhile attending a math and science high school in the Chicago area, Dr. Ema completed a research project on dental implants. That little project set her on the path to becoming a dentist.\nDental Education\nDr. Ema earned her Doctor of Dental Surgery degree at the University of Illinois at Chicago College of Dentistry where she received multiple awards for leadership and clinical excellence.\nAir Force Dentist\nFollowing in her grandfatherâs footsteps, Dr. Ema went on to serve as a dentist in the United States Air Force. She completed her Advanced Education in General Dentistry residency program at Scott Air Force Base and went on to provide dental care for service members and their families at Hanscom Air Force Base near Boston.\nBack to Chicago\nReturning home after serving her country, she taught dental students at her alma mater before Printers Row Dental Studio was born.\nâI wanted to build something that was focused on creating long-term relationships with patients while representing my priorities of compassion, integrity, and excellence.â\nGiving Back\nPassionate about people, she loves volunteering at home and abroad. Sheâs had the honor of providing dentistry to remote islanders in Fiji and rural Mayan children in Guatemala, as well as serving on a military humanitarian mission to Honduras. To express her gratitude to the men and women who serve this country, she offers free dental care for veterans on Veterans Day.\nPersonal Life\nShe loves spending time with family and friends. She also enjoys trying unique foods and restaurants, pilates, Chicago street festivals, and traveling. a few recent highlights include a trip to Japan, and a Dental mission yoga retreat to the Dominican Republic.\nâMy mission is to help you look, feel, and be your best!â\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896133",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/smile-gallery",
      "title": "Smile gallery Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nStunning Smile Transformation\nschedule appointment\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896135",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/stories",
      "title": "Patient Reviews for Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nPatient Stories\nschedule appointment\nShare Your Story\nPatients love Printers Row Dental Studio and we love sharing their stories. If you enjoyed your experience with us, a note from you would help others looking for a world class dental experience. Please leave us a review on one of the following sites:\nâWell worth the moneyâ\nDr. Ema and her staff are amazing! Incredibly professional, explanatory, and thorough in their work. The pricing and membership plans are well worth the money. I would recommend this place to anyone; they truly take care of you and your dental health!\ncaroline r.\nâamazing dentistâ\nIf you are looking for an amazing dentist in Chicago, look no further! Dr. Ema is professional, caring and detailed-oriented. She took her time to answer all the questions and address any concerns that I had during my visit, and she made sure that I felt comfortable during the procedure. The office staff is great, too! Always very welcoming and helpful. I highly recommend Printers Row Dental Studio!\nâVery friendlyâ\nI had such a great experience at this office! The hygienist and dentist explained things better than any office I have been to before. Not only that, my cleaning was literally painless and was also extremely efficient. I feel that my treatment plan actually makes sense in that I know exactly what I am paying for going forward. Spotlessly clean office with a great atmosphere, very friendly reception.\nâone of the bestâ\nI have been to at least a dozen different dentists in my life and this one is the best. All of the staff is kind, personable and understanding. I've never had such care and explanation during each step of cleaning, getting a filling and after care.\nâwarm, welcoming & helpfulâ\nI always enjoy my experience at Printers Row Dental. The staff is always very warm, welcoming, and helpful. It makes me feel a lot more comfortable and Dr.Ema is great.\nâgreat energyâ\nThis place is beautiful! Dylan the receptionist has a great energy and definitely made me feel welcomed. The hygienists and Dr. Kaori were just as wonderful. They play great music and gave me so much knowledge on my teeth and braces. My previous dentist didn't tell me about any of my cavities but Dr. Kaori found 6 and even showed me the photos and xrays. I felt like I really understood my mouth and like they cared. 10/10 recommend!\nâthe best dental teamâ\nI canât figure out who I love the most; from the two amazing front desk/office managers to the hygienist to Dr Emma herself, they all make coming to the dentist much more pleasurable for me. The office is welcoming, clean, they are always on time, highly amazing at what they do, and they go out of their way to ensure you have the best care. Thank you to the best dental team in Chicago!\nâbest experienceâ\nBest experience you can have at a dentist. Seamless, informative and very well priced. Highly recommend!!\nâincredibly thoroughâ\nI had my first cleaning here yesterday and I have never been more impressed with a dental office. I get anxiety while going to the dentist but everyone here is super educational and helped me understand things that a previous dentist has never done. They were also incredibly thorough while cleaning my teeth. I canât say enough good things about this office!\nâFriendly neighborhood dentist!â\nFriendly neighborhood dentist! Dr. Ema is so easy to talk to, non-judgmental, and incredibly informative. Her office staff is fantastic too - Dillon was great at the front desk. So thankful to have found a wonderful team in my new city!\nCharlotte E.\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896136",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/connect",
      "title": "Contact Printers Row Dental Studio | Chicago, IL",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nConnect with Us\nVisit Printers Row Dental Studio in Chicago, IL\nschedule appointment\nWe canât wait to meet you\n312-435-0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule an appointment\nget directions\n705 S Clark St\nSuite 1Aâ¨\nChicago, IL 60605\nsend us a message\nThank you for reaching out!\nYour message has been sent. We'll be in touch soon.\nOops! Something went wrong while submitting the form.",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896138",
        "status_code": "200"
      }
    },
    {
      "url": "https://prdentalstudio.com/preventative-exams/",
      "title": "Cosmetic Family Dentist Chicago, IL | Printers Row Dental",
      "content": "The Printers Row Difference\nPatient Center\nMeet Your Smile Artist\nSmile Services\nSmile Gallery\nChicago Veneers\nPatient Reviews\nconnect with us\nschedule an appointment\nWorld Class Smile Care\nschedule appointment\nGeneral Dentistry\nKeep your smile for life with preventative and comprehensive treatments.\nProphylaxis (Teeth Cleaning)\nFluoride Treatments\ndigital X-Rays\nOral Cancer Screening\nOcclusal Exam\nDental Emergencies\nTooth Colored Fillings\nDental Sealants\nRoot Canal Therapy\nPeriodontal Care\nSedation Dentistry\nTooth Extractions\nWisdom Tooth Removal\nNightguards for Grinding\nMouthguards\nTMJ Treatment\nSleep Apnea Solutions\nLaser Dentistry\nIn-office 3D Printing\nCosmetic & Restorative Solutions\nSave and transform your smile with handcrafted treatment options.\nInvisalignÂ® Orthodontic Solutions\nDental Implants\nImplant-supported Dentures\nSnap-On Smiles\nVITA EasyshadeÂ® for Tooth Color Matching\nPorcelain Veneers\nKOR in-office Whitening\nSpecialty technology\nTake-home Teeth Whitening\nComposite Bonding\nGum Contouring\nBone & Sinus Grafting\nCONNECT WITH US\n312.435.0411\nor request an appointment online to set up your first visit. Weâll be in touch soon.\nschedule appointment\nlocation & hours",
      "content_type": "general",
      "metadata": {
        "domain": "prdentalstudio.com",
        "scraped_at": "1762896140",
        "status_code": "200"
      }
    }
  ]
}